grevaillot/svd_tools/headers/ATSAMR35J16B/gclk.h
#pragma once 

/* --- GCLK: Generic Clock Generator -------------------------------- */

/** @defgroup gclk_registers Generic Clock Generator Register
@{*/

/** GCLK_CTRLA Control **/
#define GCLK_CTRLA			MMIO32(GCLK_BASE + 0x00)
/** GCLK_SYNCBUSY Synchronization Busy **/
#define GCLK_SYNCBUSY			MMIO32(GCLK_BASE + 0x04)
/** GCLK_GENCTRL0 Generic Clock Generator Control **/
#define GCLK_GENCTRL0			MMIO32(GCLK_BASE + 0x20)
/** GCLK_GENCTRL1 Generic Clock Generator Control **/
#define GCLK_GENCTRL1			MMIO32(GCLK_BASE + 0x24)
/** GCLK_GENCTRL2 Generic Clock Generator Control **/
#define GCLK_GENCTRL2			MMIO32(GCLK_BASE + 0x28)
/** GCLK_GENCTRL3 Generic Clock Generator Control **/
#define GCLK_GENCTRL3			MMIO32(GCLK_BASE + 0x2c)
/** GCLK_GENCTRL4 Generic Clock Generator Control **/
#define GCLK_GENCTRL4			MMIO32(GCLK_BASE + 0x30)
/** GCLK_GENCTRL5 Generic Clock Generator Control **/
#define GCLK_GENCTRL5			MMIO32(GCLK_BASE + 0x34)
/** GCLK_GENCTRL6 Generic Clock Generator Control **/
#define GCLK_GENCTRL6			MMIO32(GCLK_BASE + 0x38)
/** GCLK_GENCTRL7 Generic Clock Generator Control **/
#define GCLK_GENCTRL7			MMIO32(GCLK_BASE + 0x3c)
/** GCLK_GENCTRL8 Generic Clock Generator Control **/
#define GCLK_GENCTRL8			MMIO32(GCLK_BASE + 0x40)
/** GCLK_PCHCTRL0 Peripheral Clock Control **/
#define GCLK_PCHCTRL0			MMIO32(GCLK_BASE + 0x80)
/** GCLK_PCHCTRL1 Peripheral Clock Control **/
#define GCLK_PCHCTRL1			MMIO32(GCLK_BASE + 0x84)
/** GCLK_PCHCTRL2 Peripheral Clock Control **/
#define GCLK_PCHCTRL2			MMIO32(GCLK_BASE + 0x88)
/** GCLK_PCHCTRL3 Peripheral Clock Control **/
#define GCLK_PCHCTRL3			MMIO32(GCLK_BASE + 0x8c)
/** GCLK_PCHCTRL4 Peripheral Clock Control **/
#define GCLK_PCHCTRL4			MMIO32(GCLK_BASE + 0x90)
/** GCLK_PCHCTRL5 Peripheral Clock Control **/
#define GCLK_PCHCTRL5			MMIO32(GCLK_BASE + 0x94)
/** GCLK_PCHCTRL6 Peripheral Clock Control **/
#define GCLK_PCHCTRL6			MMIO32(GCLK_BASE + 0x98)
/** GCLK_PCHCTRL7 Peripheral Clock Control **/
#define GCLK_PCHCTRL7			MMIO32(GCLK_BASE + 0x9c)
/** GCLK_PCHCTRL8 Peripheral Clock Control **/
#define GCLK_PCHCTRL8			MMIO32(GCLK_BASE + 0xa0)
/** GCLK_PCHCTRL9 Peripheral Clock Control **/
#define GCLK_PCHCTRL9			MMIO32(GCLK_BASE + 0xa4)
/** GCLK_PCHCTRL10 Peripheral Clock Control **/
#define GCLK_PCHCTRL10			MMIO32(GCLK_BASE + 0xa8)
/** GCLK_PCHCTRL11 Peripheral Clock Control **/
#define GCLK_PCHCTRL11			MMIO32(GCLK_BASE + 0xac)
/** GCLK_PCHCTRL12 Peripheral Clock Control **/
#define GCLK_PCHCTRL12			MMIO32(GCLK_BASE + 0xb0)
/** GCLK_PCHCTRL13 Peripheral Clock Control **/
#define GCLK_PCHCTRL13			MMIO32(GCLK_BASE + 0xb4)
/** GCLK_PCHCTRL14 Peripheral Clock Control **/
#define GCLK_PCHCTRL14			MMIO32(GCLK_BASE + 0xb8)
/** GCLK_PCHCTRL15 Peripheral Clock Control **/
#define GCLK_PCHCTRL15			MMIO32(GCLK_BASE + 0xbc)
/** GCLK_PCHCTRL16 Peripheral Clock Control **/
#define GCLK_PCHCTRL16			MMIO32(GCLK_BASE + 0xc0)
/** GCLK_PCHCTRL17 Peripheral Clock Control **/
#define GCLK_PCHCTRL17			MMIO32(GCLK_BASE + 0xc4)
/** GCLK_PCHCTRL18 Peripheral Clock Control **/
#define GCLK_PCHCTRL18			MMIO32(GCLK_BASE + 0xc8)
/** GCLK_PCHCTRL19 Peripheral Clock Control **/
#define GCLK_PCHCTRL19			MMIO32(GCLK_BASE + 0xcc)
/** GCLK_PCHCTRL20 Peripheral Clock Control **/
#define GCLK_PCHCTRL20			MMIO32(GCLK_BASE + 0xd0)
/** GCLK_PCHCTRL21 Peripheral Clock Control **/
#define GCLK_PCHCTRL21			MMIO32(GCLK_BASE + 0xd4)
/** GCLK_PCHCTRL22 Peripheral Clock Control **/
#define GCLK_PCHCTRL22			MMIO32(GCLK_BASE + 0xd8)
/** GCLK_PCHCTRL23 Peripheral Clock Control **/
#define GCLK_PCHCTRL23			MMIO32(GCLK_BASE + 0xdc)
/** GCLK_PCHCTRL24 Peripheral Clock Control **/
#define GCLK_PCHCTRL24			MMIO32(GCLK_BASE + 0xe0)
/** GCLK_PCHCTRL25 Peripheral Clock Control **/
#define GCLK_PCHCTRL25			MMIO32(GCLK_BASE + 0xe4)
/** GCLK_PCHCTRL26 Peripheral Clock Control **/
#define GCLK_PCHCTRL26			MMIO32(GCLK_BASE + 0xe8)
/** GCLK_PCHCTRL27 Peripheral Clock Control **/
#define GCLK_PCHCTRL27			MMIO32(GCLK_BASE + 0xec)
/** GCLK_PCHCTRL28 Peripheral Clock Control **/
#define GCLK_PCHCTRL28			MMIO32(GCLK_BASE + 0xf0)
/** GCLK_PCHCTRL29 Peripheral Clock Control **/
#define GCLK_PCHCTRL29			MMIO32(GCLK_BASE + 0xf4)
/** GCLK_PCHCTRL30 Peripheral Clock Control **/
#define GCLK_PCHCTRL30			MMIO32(GCLK_BASE + 0xf8)
/** GCLK_PCHCTRL31 Peripheral Clock Control **/
#define GCLK_PCHCTRL31			MMIO32(GCLK_BASE + 0xfc)
/** GCLK_PCHCTRL32 Peripheral Clock Control **/
#define GCLK_PCHCTRL32			MMIO32(GCLK_BASE + 0x100)
/** GCLK_PCHCTRL33 Peripheral Clock Control **/
#define GCLK_PCHCTRL33			MMIO32(GCLK_BASE + 0x104)
/** GCLK_PCHCTRL34 Peripheral Clock Control **/
#define GCLK_PCHCTRL34			MMIO32(GCLK_BASE + 0x108)
/** GCLK_PCHCTRL35 Peripheral Clock Control **/
#define GCLK_PCHCTRL35			MMIO32(GCLK_BASE + 0x10c)

/**@}*/


/** @defgroup gclk_ctrla CTRLA Control
@{*/

/** GCLK_CTRLA_SWRST Software Reset **/
#define GCLK_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup gclk_syncbusy SYNCBUSY Synchronization Busy
@{*/

/** GCLK_SYNCBUSY_GENCTRL8 Generic Clock Generator Control 8 Synchronization Busy bits **/
#define GCLK_SYNCBUSY_GENCTRL8		(1 << 10)
/** GCLK_SYNCBUSY_GENCTRL7 Generic Clock Generator Control 7 Synchronization Busy bits **/
#define GCLK_SYNCBUSY_GENCTRL7		(1 << 9)
/** GCLK_SYNCBUSY_GENCTRL6 Generic Clock Generator Control 6 Synchronization Busy bits **/
#define GCLK_SYNCBUSY_GENCTRL6		(1 << 8)
/** GCLK_SYNCBUSY_GENCTRL5 Generic Clock Generator Control 5 Synchronization Busy bits **/
#define GCLK_SYNCBUSY_GENCTRL5		(1 << 7)
/** GCLK_SYNCBUSY_GENCTRL4 Generic Clock Generator Control 4 Synchronization Busy bits **/
#define GCLK_SYNCBUSY_GENCTRL4		(1 << 6)
/** GCLK_SYNCBUSY_GENCTRL3 Generic Clock Generator Control 3 Synchronization Busy bits **/
#define GCLK_SYNCBUSY_GENCTRL3		(1 << 5)
/** GCLK_SYNCBUSY_GENCTRL2 Generic Clock Generator Control 2 Synchronization Busy bits **/
#define GCLK_SYNCBUSY_GENCTRL2		(1 << 4)
/** GCLK_SYNCBUSY_GENCTRL1 Generic Clock Generator Control 1 Synchronization Busy bits **/
#define GCLK_SYNCBUSY_GENCTRL1		(1 << 3)
/** GCLK_SYNCBUSY_GENCTRL0 Generic Clock Generator Control 0 Synchronization Busy bits **/
#define GCLK_SYNCBUSY_GENCTRL0		(1 << 2)
/** GCLK_SYNCBUSY_SWRST Software Reset Synchroniation Busy bit **/
#define GCLK_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup gclk_genctrl0 GENCTRL0 Generic Clock Generator Control
@{*/


#define GCLK_GENCTRL0_DIV_SHIFT		16
#define GCLK_GENCTRL0_DIV_MASK		0xffff
/** @defgroup gclk_genctrl0_div DIV Division Factor
@{*/
/**@}*/

/** GCLK_GENCTRL0_RUNSTDBY Run in Standby **/
#define GCLK_GENCTRL0_RUNSTDBY		(1 << 13)
/** GCLK_GENCTRL0_DIVSEL Divide Selection **/
#define GCLK_GENCTRL0_DIVSEL		(1 << 12)
/** GCLK_GENCTRL0_OE Output Enable **/
#define GCLK_GENCTRL0_OE		(1 << 11)
/** GCLK_GENCTRL0_OOV Output Off Value **/
#define GCLK_GENCTRL0_OOV		(1 << 10)
/** GCLK_GENCTRL0_IDC Improve Duty Cycle **/
#define GCLK_GENCTRL0_IDC		(1 << 9)
/** GCLK_GENCTRL0_GENEN Generic Clock Generator Enable **/
#define GCLK_GENCTRL0_GENEN		(1 << 8)

