grevaillot/svd_tools/headers/ATSAMR35J16B/gclk.h
#define GCLK_GENCTRL0_SRC_SHIFT		0
#define GCLK_GENCTRL0_SRC_MASK		0x0f
/** @defgroup gclk_genctrl0_src SRC Source Select
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_genctrl1 GENCTRL1 Generic Clock Generator Control
@{*/


#define GCLK_GENCTRL1_DIV_SHIFT		16
#define GCLK_GENCTRL1_DIV_MASK		0xffff
/** @defgroup gclk_genctrl1_div DIV Division Factor
@{*/
/**@}*/

/** GCLK_GENCTRL1_RUNSTDBY Run in Standby **/
#define GCLK_GENCTRL1_RUNSTDBY		(1 << 13)
/** GCLK_GENCTRL1_DIVSEL Divide Selection **/
#define GCLK_GENCTRL1_DIVSEL		(1 << 12)
/** GCLK_GENCTRL1_OE Output Enable **/
#define GCLK_GENCTRL1_OE		(1 << 11)
/** GCLK_GENCTRL1_OOV Output Off Value **/
#define GCLK_GENCTRL1_OOV		(1 << 10)
/** GCLK_GENCTRL1_IDC Improve Duty Cycle **/
#define GCLK_GENCTRL1_IDC		(1 << 9)
/** GCLK_GENCTRL1_GENEN Generic Clock Generator Enable **/
#define GCLK_GENCTRL1_GENEN		(1 << 8)

#define GCLK_GENCTRL1_SRC_SHIFT		0
#define GCLK_GENCTRL1_SRC_MASK		0x0f
/** @defgroup gclk_genctrl1_src SRC Source Select
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_genctrl2 GENCTRL2 Generic Clock Generator Control
@{*/


#define GCLK_GENCTRL2_DIV_SHIFT		16
#define GCLK_GENCTRL2_DIV_MASK		0xffff
/** @defgroup gclk_genctrl2_div DIV Division Factor
@{*/
/**@}*/

/** GCLK_GENCTRL2_RUNSTDBY Run in Standby **/
#define GCLK_GENCTRL2_RUNSTDBY		(1 << 13)
/** GCLK_GENCTRL2_DIVSEL Divide Selection **/
#define GCLK_GENCTRL2_DIVSEL		(1 << 12)
/** GCLK_GENCTRL2_OE Output Enable **/
#define GCLK_GENCTRL2_OE		(1 << 11)
/** GCLK_GENCTRL2_OOV Output Off Value **/
#define GCLK_GENCTRL2_OOV		(1 << 10)
/** GCLK_GENCTRL2_IDC Improve Duty Cycle **/
#define GCLK_GENCTRL2_IDC		(1 << 9)
/** GCLK_GENCTRL2_GENEN Generic Clock Generator Enable **/
#define GCLK_GENCTRL2_GENEN		(1 << 8)

#define GCLK_GENCTRL2_SRC_SHIFT		0
#define GCLK_GENCTRL2_SRC_MASK		0x0f
/** @defgroup gclk_genctrl2_src SRC Source Select
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_genctrl3 GENCTRL3 Generic Clock Generator Control
@{*/


#define GCLK_GENCTRL3_DIV_SHIFT		16
#define GCLK_GENCTRL3_DIV_MASK		0xffff
/** @defgroup gclk_genctrl3_div DIV Division Factor
@{*/
/**@}*/

/** GCLK_GENCTRL3_RUNSTDBY Run in Standby **/
#define GCLK_GENCTRL3_RUNSTDBY		(1 << 13)
/** GCLK_GENCTRL3_DIVSEL Divide Selection **/
#define GCLK_GENCTRL3_DIVSEL		(1 << 12)
/** GCLK_GENCTRL3_OE Output Enable **/
#define GCLK_GENCTRL3_OE		(1 << 11)
/** GCLK_GENCTRL3_OOV Output Off Value **/
#define GCLK_GENCTRL3_OOV		(1 << 10)
/** GCLK_GENCTRL3_IDC Improve Duty Cycle **/
#define GCLK_GENCTRL3_IDC		(1 << 9)
/** GCLK_GENCTRL3_GENEN Generic Clock Generator Enable **/
#define GCLK_GENCTRL3_GENEN		(1 << 8)

#define GCLK_GENCTRL3_SRC_SHIFT		0
#define GCLK_GENCTRL3_SRC_MASK		0x0f
/** @defgroup gclk_genctrl3_src SRC Source Select
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_genctrl4 GENCTRL4 Generic Clock Generator Control
@{*/


#define GCLK_GENCTRL4_DIV_SHIFT		16
#define GCLK_GENCTRL4_DIV_MASK		0xffff
/** @defgroup gclk_genctrl4_div DIV Division Factor
@{*/
/**@}*/

/** GCLK_GENCTRL4_RUNSTDBY Run in Standby **/
#define GCLK_GENCTRL4_RUNSTDBY		(1 << 13)
/** GCLK_GENCTRL4_DIVSEL Divide Selection **/
#define GCLK_GENCTRL4_DIVSEL		(1 << 12)
/** GCLK_GENCTRL4_OE Output Enable **/
#define GCLK_GENCTRL4_OE		(1 << 11)
/** GCLK_GENCTRL4_OOV Output Off Value **/
#define GCLK_GENCTRL4_OOV		(1 << 10)
/** GCLK_GENCTRL4_IDC Improve Duty Cycle **/
#define GCLK_GENCTRL4_IDC		(1 << 9)
/** GCLK_GENCTRL4_GENEN Generic Clock Generator Enable **/
#define GCLK_GENCTRL4_GENEN		(1 << 8)

#define GCLK_GENCTRL4_SRC_SHIFT		0
#define GCLK_GENCTRL4_SRC_MASK		0x0f
/** @defgroup gclk_genctrl4_src SRC Source Select
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_genctrl5 GENCTRL5 Generic Clock Generator Control
@{*/


#define GCLK_GENCTRL5_DIV_SHIFT		16
#define GCLK_GENCTRL5_DIV_MASK		0xffff
/** @defgroup gclk_genctrl5_div DIV Division Factor
@{*/
/**@}*/

/** GCLK_GENCTRL5_RUNSTDBY Run in Standby **/
#define GCLK_GENCTRL5_RUNSTDBY		(1 << 13)
/** GCLK_GENCTRL5_DIVSEL Divide Selection **/
#define GCLK_GENCTRL5_DIVSEL		(1 << 12)
/** GCLK_GENCTRL5_OE Output Enable **/
#define GCLK_GENCTRL5_OE		(1 << 11)
/** GCLK_GENCTRL5_OOV Output Off Value **/
#define GCLK_GENCTRL5_OOV		(1 << 10)
/** GCLK_GENCTRL5_IDC Improve Duty Cycle **/
#define GCLK_GENCTRL5_IDC		(1 << 9)
/** GCLK_GENCTRL5_GENEN Generic Clock Generator Enable **/
#define GCLK_GENCTRL5_GENEN		(1 << 8)

#define GCLK_GENCTRL5_SRC_SHIFT		0
#define GCLK_GENCTRL5_SRC_MASK		0x0f
/** @defgroup gclk_genctrl5_src SRC Source Select
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_genctrl6 GENCTRL6 Generic Clock Generator Control
@{*/


#define GCLK_GENCTRL6_DIV_SHIFT		16
#define GCLK_GENCTRL6_DIV_MASK		0xffff
/** @defgroup gclk_genctrl6_div DIV Division Factor
@{*/
/**@}*/

/** GCLK_GENCTRL6_RUNSTDBY Run in Standby **/
#define GCLK_GENCTRL6_RUNSTDBY		(1 << 13)
/** GCLK_GENCTRL6_DIVSEL Divide Selection **/
#define GCLK_GENCTRL6_DIVSEL		(1 << 12)
/** GCLK_GENCTRL6_OE Output Enable **/
#define GCLK_GENCTRL6_OE		(1 << 11)
/** GCLK_GENCTRL6_OOV Output Off Value **/
#define GCLK_GENCTRL6_OOV		(1 << 10)
/** GCLK_GENCTRL6_IDC Improve Duty Cycle **/
#define GCLK_GENCTRL6_IDC		(1 << 9)
/** GCLK_GENCTRL6_GENEN Generic Clock Generator Enable **/
#define GCLK_GENCTRL6_GENEN		(1 << 8)

#define GCLK_GENCTRL6_SRC_SHIFT		0
#define GCLK_GENCTRL6_SRC_MASK		0x0f
/** @defgroup gclk_genctrl6_src SRC Source Select
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_genctrl7 GENCTRL7 Generic Clock Generator Control
@{*/


#define GCLK_GENCTRL7_DIV_SHIFT		16
#define GCLK_GENCTRL7_DIV_MASK		0xffff
/** @defgroup gclk_genctrl7_div DIV Division Factor
@{*/
/**@}*/

/** GCLK_GENCTRL7_RUNSTDBY Run in Standby **/
#define GCLK_GENCTRL7_RUNSTDBY		(1 << 13)
/** GCLK_GENCTRL7_DIVSEL Divide Selection **/
#define GCLK_GENCTRL7_DIVSEL		(1 << 12)
/** GCLK_GENCTRL7_OE Output Enable **/
#define GCLK_GENCTRL7_OE		(1 << 11)
/** GCLK_GENCTRL7_OOV Output Off Value **/
#define GCLK_GENCTRL7_OOV		(1 << 10)
/** GCLK_GENCTRL7_IDC Improve Duty Cycle **/
#define GCLK_GENCTRL7_IDC		(1 << 9)
/** GCLK_GENCTRL7_GENEN Generic Clock Generator Enable **/
#define GCLK_GENCTRL7_GENEN		(1 << 8)

