grevaillot/svd_tools/headers/ATSAMR35J16B/gclk.h
#define GCLK_GENCTRL7_SRC_SHIFT		0
#define GCLK_GENCTRL7_SRC_MASK		0x0f
/** @defgroup gclk_genctrl7_src SRC Source Select
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_genctrl8 GENCTRL8 Generic Clock Generator Control
@{*/


#define GCLK_GENCTRL8_DIV_SHIFT		16
#define GCLK_GENCTRL8_DIV_MASK		0xffff
/** @defgroup gclk_genctrl8_div DIV Division Factor
@{*/
/**@}*/

/** GCLK_GENCTRL8_RUNSTDBY Run in Standby **/
#define GCLK_GENCTRL8_RUNSTDBY		(1 << 13)
/** GCLK_GENCTRL8_DIVSEL Divide Selection **/
#define GCLK_GENCTRL8_DIVSEL		(1 << 12)
/** GCLK_GENCTRL8_OE Output Enable **/
#define GCLK_GENCTRL8_OE		(1 << 11)
/** GCLK_GENCTRL8_OOV Output Off Value **/
#define GCLK_GENCTRL8_OOV		(1 << 10)
/** GCLK_GENCTRL8_IDC Improve Duty Cycle **/
#define GCLK_GENCTRL8_IDC		(1 << 9)
/** GCLK_GENCTRL8_GENEN Generic Clock Generator Enable **/
#define GCLK_GENCTRL8_GENEN		(1 << 8)

#define GCLK_GENCTRL8_SRC_SHIFT		0
#define GCLK_GENCTRL8_SRC_MASK		0x0f
/** @defgroup gclk_genctrl8_src SRC Source Select
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl0 PCHCTRL0 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL0_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL0_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL0_CHEN Channel Enable **/
#define GCLK_PCHCTRL0_CHEN		(1 << 6)

#define GCLK_PCHCTRL0_GEN_SHIFT		0
#define GCLK_PCHCTRL0_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl0_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl1 PCHCTRL1 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL1_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL1_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL1_CHEN Channel Enable **/
#define GCLK_PCHCTRL1_CHEN		(1 << 6)

#define GCLK_PCHCTRL1_GEN_SHIFT		0
#define GCLK_PCHCTRL1_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl1_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl2 PCHCTRL2 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL2_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL2_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL2_CHEN Channel Enable **/
#define GCLK_PCHCTRL2_CHEN		(1 << 6)

#define GCLK_PCHCTRL2_GEN_SHIFT		0
#define GCLK_PCHCTRL2_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl2_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl3 PCHCTRL3 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL3_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL3_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL3_CHEN Channel Enable **/
#define GCLK_PCHCTRL3_CHEN		(1 << 6)

#define GCLK_PCHCTRL3_GEN_SHIFT		0
#define GCLK_PCHCTRL3_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl3_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl4 PCHCTRL4 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL4_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL4_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL4_CHEN Channel Enable **/
#define GCLK_PCHCTRL4_CHEN		(1 << 6)

#define GCLK_PCHCTRL4_GEN_SHIFT		0
#define GCLK_PCHCTRL4_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl4_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl5 PCHCTRL5 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL5_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL5_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL5_CHEN Channel Enable **/
#define GCLK_PCHCTRL5_CHEN		(1 << 6)

#define GCLK_PCHCTRL5_GEN_SHIFT		0
#define GCLK_PCHCTRL5_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl5_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl6 PCHCTRL6 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL6_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL6_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL6_CHEN Channel Enable **/
#define GCLK_PCHCTRL6_CHEN		(1 << 6)

#define GCLK_PCHCTRL6_GEN_SHIFT		0
#define GCLK_PCHCTRL6_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl6_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl7 PCHCTRL7 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL7_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL7_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL7_CHEN Channel Enable **/
#define GCLK_PCHCTRL7_CHEN		(1 << 6)

#define GCLK_PCHCTRL7_GEN_SHIFT		0
#define GCLK_PCHCTRL7_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl7_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl8 PCHCTRL8 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL8_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL8_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL8_CHEN Channel Enable **/
#define GCLK_PCHCTRL8_CHEN		(1 << 6)

#define GCLK_PCHCTRL8_GEN_SHIFT		0
#define GCLK_PCHCTRL8_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl8_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl9 PCHCTRL9 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL9_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL9_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL9_CHEN Channel Enable **/
#define GCLK_PCHCTRL9_CHEN		(1 << 6)

#define GCLK_PCHCTRL9_GEN_SHIFT		0
#define GCLK_PCHCTRL9_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl9_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl10 PCHCTRL10 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL10_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL10_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL10_CHEN Channel Enable **/
#define GCLK_PCHCTRL10_CHEN		(1 << 6)

#define GCLK_PCHCTRL10_GEN_SHIFT		0
#define GCLK_PCHCTRL10_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl10_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl11 PCHCTRL11 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL11_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL11_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL11_CHEN Channel Enable **/
#define GCLK_PCHCTRL11_CHEN		(1 << 6)

#define GCLK_PCHCTRL11_GEN_SHIFT		0
#define GCLK_PCHCTRL11_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl11_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl12 PCHCTRL12 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL12_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL12_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL12_CHEN Channel Enable **/
#define GCLK_PCHCTRL12_CHEN		(1 << 6)

#define GCLK_PCHCTRL12_GEN_SHIFT		0
#define GCLK_PCHCTRL12_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl12_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl13 PCHCTRL13 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL13_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL13_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL13_CHEN Channel Enable **/
#define GCLK_PCHCTRL13_CHEN		(1 << 6)

