grevaillot/svd_tools/headers/ATSAMR35J16B/gclk.h
#define GCLK_PCHCTRL13_GEN_SHIFT		0
#define GCLK_PCHCTRL13_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl13_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl14 PCHCTRL14 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL14_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL14_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL14_CHEN Channel Enable **/
#define GCLK_PCHCTRL14_CHEN		(1 << 6)

#define GCLK_PCHCTRL14_GEN_SHIFT		0
#define GCLK_PCHCTRL14_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl14_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl15 PCHCTRL15 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL15_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL15_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL15_CHEN Channel Enable **/
#define GCLK_PCHCTRL15_CHEN		(1 << 6)

#define GCLK_PCHCTRL15_GEN_SHIFT		0
#define GCLK_PCHCTRL15_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl15_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl16 PCHCTRL16 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL16_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL16_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL16_CHEN Channel Enable **/
#define GCLK_PCHCTRL16_CHEN		(1 << 6)

#define GCLK_PCHCTRL16_GEN_SHIFT		0
#define GCLK_PCHCTRL16_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl16_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl17 PCHCTRL17 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL17_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL17_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL17_CHEN Channel Enable **/
#define GCLK_PCHCTRL17_CHEN		(1 << 6)

#define GCLK_PCHCTRL17_GEN_SHIFT		0
#define GCLK_PCHCTRL17_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl17_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl18 PCHCTRL18 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL18_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL18_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL18_CHEN Channel Enable **/
#define GCLK_PCHCTRL18_CHEN		(1 << 6)

#define GCLK_PCHCTRL18_GEN_SHIFT		0
#define GCLK_PCHCTRL18_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl18_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl19 PCHCTRL19 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL19_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL19_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL19_CHEN Channel Enable **/
#define GCLK_PCHCTRL19_CHEN		(1 << 6)

#define GCLK_PCHCTRL19_GEN_SHIFT		0
#define GCLK_PCHCTRL19_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl19_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl20 PCHCTRL20 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL20_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL20_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL20_CHEN Channel Enable **/
#define GCLK_PCHCTRL20_CHEN		(1 << 6)

#define GCLK_PCHCTRL20_GEN_SHIFT		0
#define GCLK_PCHCTRL20_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl20_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl21 PCHCTRL21 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL21_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL21_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL21_CHEN Channel Enable **/
#define GCLK_PCHCTRL21_CHEN		(1 << 6)

#define GCLK_PCHCTRL21_GEN_SHIFT		0
#define GCLK_PCHCTRL21_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl21_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl22 PCHCTRL22 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL22_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL22_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL22_CHEN Channel Enable **/
#define GCLK_PCHCTRL22_CHEN		(1 << 6)

#define GCLK_PCHCTRL22_GEN_SHIFT		0
#define GCLK_PCHCTRL22_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl22_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl23 PCHCTRL23 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL23_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL23_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL23_CHEN Channel Enable **/
#define GCLK_PCHCTRL23_CHEN		(1 << 6)

#define GCLK_PCHCTRL23_GEN_SHIFT		0
#define GCLK_PCHCTRL23_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl23_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl24 PCHCTRL24 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL24_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL24_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL24_CHEN Channel Enable **/
#define GCLK_PCHCTRL24_CHEN		(1 << 6)

#define GCLK_PCHCTRL24_GEN_SHIFT		0
#define GCLK_PCHCTRL24_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl24_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl25 PCHCTRL25 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL25_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL25_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL25_CHEN Channel Enable **/
#define GCLK_PCHCTRL25_CHEN		(1 << 6)

#define GCLK_PCHCTRL25_GEN_SHIFT		0
#define GCLK_PCHCTRL25_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl25_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl26 PCHCTRL26 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL26_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL26_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL26_CHEN Channel Enable **/
#define GCLK_PCHCTRL26_CHEN		(1 << 6)

#define GCLK_PCHCTRL26_GEN_SHIFT		0
#define GCLK_PCHCTRL26_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl26_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl27 PCHCTRL27 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL27_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL27_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL27_CHEN Channel Enable **/
#define GCLK_PCHCTRL27_CHEN		(1 << 6)

#define GCLK_PCHCTRL27_GEN_SHIFT		0
#define GCLK_PCHCTRL27_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl27_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl28 PCHCTRL28 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL28_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL28_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL28_CHEN Channel Enable **/
#define GCLK_PCHCTRL28_CHEN		(1 << 6)

#define GCLK_PCHCTRL28_GEN_SHIFT		0
#define GCLK_PCHCTRL28_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl28_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl29 PCHCTRL29 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL29_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL29_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL29_CHEN Channel Enable **/
#define GCLK_PCHCTRL29_CHEN		(1 << 6)

#define GCLK_PCHCTRL29_GEN_SHIFT		0
#define GCLK_PCHCTRL29_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl29_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl30 PCHCTRL30 Peripheral Clock Control
@{*/

