grevaillot/svd_tools/headers/ATSAMR35J16B/gclk.h
/** GCLK_PCHCTRL30_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL30_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL30_CHEN Channel Enable **/
#define GCLK_PCHCTRL30_CHEN		(1 << 6)

#define GCLK_PCHCTRL30_GEN_SHIFT		0
#define GCLK_PCHCTRL30_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl30_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl31 PCHCTRL31 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL31_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL31_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL31_CHEN Channel Enable **/
#define GCLK_PCHCTRL31_CHEN		(1 << 6)

#define GCLK_PCHCTRL31_GEN_SHIFT		0
#define GCLK_PCHCTRL31_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl31_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl32 PCHCTRL32 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL32_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL32_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL32_CHEN Channel Enable **/
#define GCLK_PCHCTRL32_CHEN		(1 << 6)

#define GCLK_PCHCTRL32_GEN_SHIFT		0
#define GCLK_PCHCTRL32_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl32_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl33 PCHCTRL33 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL33_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL33_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL33_CHEN Channel Enable **/
#define GCLK_PCHCTRL33_CHEN		(1 << 6)

#define GCLK_PCHCTRL33_GEN_SHIFT		0
#define GCLK_PCHCTRL33_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl33_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl34 PCHCTRL34 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL34_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL34_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL34_CHEN Channel Enable **/
#define GCLK_PCHCTRL34_CHEN		(1 << 6)

#define GCLK_PCHCTRL34_GEN_SHIFT		0
#define GCLK_PCHCTRL34_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl34_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/

/** @defgroup gclk_pchctrl35 PCHCTRL35 Peripheral Clock Control
@{*/

/** GCLK_PCHCTRL35_WRTLOCK Write Lock **/
#define GCLK_PCHCTRL35_WRTLOCK		(1 << 7)
/** GCLK_PCHCTRL35_CHEN Channel Enable **/
#define GCLK_PCHCTRL35_CHEN		(1 << 6)

#define GCLK_PCHCTRL35_GEN_SHIFT		0
#define GCLK_PCHCTRL35_GEN_MASK		0x0f
/** @defgroup gclk_pchctrl35_gen GEN Generic Clock Generator
@{*/
/**@}*/


/**@}*/
